Enums/ХарактерЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ХарактерЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БракВПроизводстве</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенияВоВнеоборотныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаСбыт</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщепроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперационныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноЗаготовительныеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УправлениеЗатратами/Ext/Module.bsl
// Процедура формирует движения в регистры по прочим затратам по управленческому учету
//
//	Параметры:
//		ДокСсылка - ссылка на документ
//		ТабЧасть  - таб. часть по которой формируются движения
//			В ней обязательно должны быть реквизиты "СтатьяЗатрат", "Сумма"
//			"Заказ", "Подразделение", "ПодразделениеОрганизации",
//			"НоменклатурнаяГруппа"
//		СтруктВал - структура с информацией о валюте
//		ВалютаРегламентированногоУчета - валюта регламентированного учета
//		ДопПараметры - структура с доп. параметрами. Возможные значения
//			"КодОперацииНЗП"  - код операции в рег. Незавершенное производство
//			"КодОперацииЗатр" - код операции в рег. Затраты на выпуск продукции
//			"ЕстьНДС"         - признак наличия НДС в документе
//
Процедура ДвиженияПоПрочимЗатратамУпр(ДокОбъект, ТабЧасть, СтруктураШапкиДокумента, ВалютаРегламентированногоУчета, ДопПараметры = Неопределено) Экспорт
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	НаборДвиженийНЗП          = ДокОбъект.Движения.НезавершенноеПроизводство;
	ТаблицаДвиженийНЗП        = НаборДвиженийНЗП.ВыгрузитьКолонки();

	НаборДвиженийЗатраты      = ДокОбъект.Движения.Затраты;
	ТаблицаДвиженийЗатраты    = НаборДвиженийЗатраты.ВыгрузитьКолонки();

	Если ДокОбъект.Движения.Найти("БракВПроизводстве") = Неопределено Тогда
		ЕстьБрак = Ложь;
	Иначе
		ЕстьБрак = Истина;
		НаборДвиженийБрак     = ДокОбъект.Движения.БракВПроизводстве;
		ТаблицаДвиженийБрак   = НаборДвиженийБрак.ВыгрузитьКолонки();
	КонецЕсли;
	
	Если ДокОбъект.Движения.Найти("СтроительствоОбъектовОсновныхСредств") = Неопределено Тогда
		ЕстьСтроит = Ложь;
	Иначе	
		ЕстьСтроит = Истина;
		
		НаборДвиженийСтроит       = ДокОбъект.Движения.СтроительствоОбъектовОсновныхСредств;
		ТаблицаДвиженийСтроит     = НаборДвиженийСтроит.ВыгрузитьКолонки();
		
	КонецЕсли;
	
	ЕстьВалютаДокумента = СтруктураШапкиДокумента.Свойство("ВалютаДокумента");
	ЕстьКурсДокумента = Ложь;
	
	// Определим доп. параметры
	КодОперацииНЗП  = Перечисления.КодыОперацийНезавершенноеПроизводство.ПустаяСсылка();
	ДокСтатьяЗатрат = Неопределено;
	ДокЗаказ        = Неопределено;
	ДокПодр         = Неопределено;
	ДокНоменклатура = Неопределено;
	ЕстьКоличество  = Ложь;
	ЕстьНДС 		= Ложь;
	ИмяРеквЗаказ    = "Заказ";
	ВидДвижения     = "Приход";
	Знак     		= 1;
	
	ДокКонтрагент 	= Неопределено;
	ЕстьКонтрагентВТабЧасти = Ложь;
	
	Если Не ДопПараметры = Неопределено Тогда
		Если ДопПараметры.Свойство("КодОперацииНЗП") Тогда
			КодОперацииНЗП = ДопПараметры["КодОперацииНЗП"];
		КонецЕсли;
		Если ДопПараметры.Свойство("КодОперацииЗатр") Тогда
			КодОперацииЗатр = ДопПараметры["КодОперацииЗатр"];
		КонецЕсли;
		Если ДопПараметры.Свойство("ЕстьНДС") Тогда
			ЕстьНДС = ДопПараметры["ЕстьНДС"];
		КонецЕсли; 
		Если ДопПараметры.Свойство("СтатьяЗатрат") Тогда
			ДокСтатьяЗатрат = ДопПараметры["СтатьяЗатрат"];
		КонецЕсли;
		Если ДопПараметры.Свойство("Заказ") Тогда
			ДокЗаказ = ДопПараметры["Заказ"];
			Если ДокЗаказ = Неопределено Тогда
				ДокЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		Если ДопПараметры.Свойство("Подразделение") Тогда
			ДокПодр = ДопПараметры["Подразделение"];
		КонецЕсли;
		Если ДопПараметры.Свойство("ИмяРеквЗаказ") Тогда
			ИмяРеквЗаказ = ДопПараметры["ИмяРеквЗаказ"];
		КонецЕсли;
		Если ДопПараметры.Свойство("ЕстьКоличество") Тогда
			ЕстьКоличество = ДопПараметры["ЕстьКоличество"];
		КонецЕсли;
		Если ДопПараметры.Свойство("Номенклатура") Тогда
			ДокНоменклатура = ДопПараметры["Номенклатура"];
		КонецЕсли;
		Если ДопПараметры.Свойство("ВидДвижения") Тогда
			ВидДвижения = ДопПараметры["ВидДвижения"];
		КонецЕсли;
		Если ДопПараметры.Свойство("Номенклатура") Тогда
			ДокНоменклатура = ДопПараметры["Номенклатура"];
		КонецЕсли;
		Если ДопПараметры.Свойство("КурсДокумента") Тогда
			КурсДок = ДопПараметры["КурсДокумента"];
			ЕстьКурсДокумента = Истина;
		КонецЕсли;
		Если ДопПараметры.Свойство("КратностьДокумента") Тогда
			КратДок = ДопПараметры["КратностьДокумента"];
		КонецЕсли;
		Если ДопПараметры.Свойство("Знак") Тогда
			Знак = ДопПараметры["Знак"];
		КонецЕсли;
		Если ДопПараметры.Свойство("Контрагент") Тогда
			ДокКонтрагент = ДопПараметры["Контрагент"];
		КонецЕсли;
		Если ДопПараметры.Свойство("ЕстьКонтрагентВТабЧасти") Тогда
			ЕстьКонтрагентВТабЧасти = ДопПараметры["ЕстьКонтрагентВТабЧасти"];
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЕстьВалютаДокумента И НЕ ЕстьКурсДокумента Тогда
		КратДок = ЗаполнениеДокументов.КратностьДокумента(ДокОбъект, ВалютаРегламентированногоУчета);
		КурсДок = ЗаполнениеДокументов.КурсДокумента     (ДокОбъект, ВалютаРегламентированногоУчета);
	КонецЕсли;
	
	Если ТипЗнч(ТабЧасть) <> Тип("ТаблицаЗначений") Тогда
		ТабличнаяЧасть = ТабЧасть.Выгрузить();
	Иначе
		ТабличнаяЧасть = ТабЧасть;
	КонецЕсли;
	
	ВыполнитьПриход = ВидДвижения = "Приход";
	
	ЕстьСуммаУпр = Ложь;
	Если Не ТабличнаяЧасть.Колонки.Найти("СуммаУпр") = Неопределено Тогда
		ЕстьСуммаУпр = Истина;
	КонецЕсли;
	
	ЕстьНДСУпр = Ложь;
	Если Не ТабличнаяЧасть.Колонки.Найти("НДСУпр") = Неопределено Тогда
		ЕстьНДСУпр = Истина;
	КонецЕсли;
	
	ЕстьПодразделениеНЗП = Ложь;
	Если Не ТабличнаяЧасть.Колонки.Найти("ПодразделениеНЗП") = Неопределено Тогда
		ЕстьПодразделениеНЗП = Истина;
	КонецЕсли;
	
	ЕстьЗаказ = Ложь;
	Если Не ТабличнаяЧасть.Колонки.Найти("Заказ") = Неопределено Тогда
		ЕстьЗаказ = Истина;
	КонецЕсли;
	
	
	// Обход таб. части
	Для Каждого СтрокаТЧ Из ТабЧасть Цикл
		
		СтатьяЗатрат = ?(ДокСтатьяЗатрат = Неопределено, СтрокаТЧ.СтатьяЗатрат,  ДокСтатьяЗатрат);
		Подр         = ?(ДокПодр         = Неопределено, СтрокаТЧ.Подразделение, ДокПодр);
		Заказ        = ?(ДокЗаказ        = Неопределено, ?(ЕстьЗаказ, СтрокаТЧ.Заказ, Документы.ЗаказПокупателя.ПустаяСсылка()), ДокЗаказ);
		
		Если Не ЗначениеЗаполнено(СтатьяЗатрат) Тогда
			Продолжить;
		КонецЕсли;
		
		ХарактерЗатрат = СтатьяЗатрат.ХарактерЗатрат;

		Если ЕстьСуммаУпр Тогда
			СуммаУпр = СтрокаТЧ.СуммаУпр;
			Если ЕстьНДСУпр Тогда
				НДСУпр = СтрокаТЧ.НДСУпр;
				СуммаУпр = СуммаУпр - НДСУпр;
			Иначе
				НДСУпр = 0;
			КонецЕсли;
		ИначеЕсли ЕстьВалютаДокумента Тогда
			Если ЕстьНДС Тогда
				Если ДокОбъект.СуммаВключаетНДС Тогда
					Стоимость = СтрокаТЧ.Сумма - СтрокаТЧ.СуммаНДС;
				Иначе
					Стоимость = СтрокаТЧ.Сумма;
				КонецЕсли; 
				НДС = СтрокаТЧ.СуммаНДС;
			Иначе
				Стоимость = СтрокаТЧ.Сумма;
				НДС = 0;
			КонецЕсли;
		
			СуммаУпр = Знак * МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Стоимость, СтруктураШапкиДокумента.ВалютаДокумента,
				 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,     КурсДок, 
				 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, КратДок, 
				 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
				 
			НДСУпр = Знак * МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(НДС, СтруктураШапкиДокумента.ВалютаДокумента,
				 СтруктураШапкиДокумента.ВалютаУправленческогоУчета,     КурсДок, 
				 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, КратДок, 
				 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
				 
		Иначе
			СуммаУпр = Знак * СтрокаТЧ.Сумма;
			НДСУпр = 0;
		КонецЕсли;
				 
			 
		Если СуммаУпр = 0 И НДСУпр = 0 Тогда
		   	Если ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
				Если НЕ ЕстьКоличество Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
			 
		Если ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда

			НоваяСтрока = ТаблицаДвиженийНЗП.Добавить();
			НоваяСтрока.Подразделение        = Подр;
			НоваяСтрока.СтатьяЗатрат         = СтатьяЗатрат;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.НоменклатурнаяГруппа;
			НоваяСтрока.Стоимость            = СуммаУпр;
			НоваяСтрока.НДС 				 = НДСУпр;
			НоваяСтрока.КодОперации          = КодОперацииНЗП;
			
			Если ЕстьПодразделениеНЗП Тогда
				НоваяСтрока.ПодразделениеНЗП           = СтрокаТЧ.ПодразделениеНЗП;
				НоваяСтрока.НоменклатурнаяГруппаНЗП    = СтрокаТЧ.НоменклатурнаяГруппаНЗП;
				НоваяСтрока.НоменклатураЗатрат         = СтрокаТЧ.ПодразделениеНЗП;
			КонецЕсли;
			
			Если ДокКонтрагент <> Неопределено Тогда
				НоваяСтрока.НоменклатураЗатрат = ДокКонтрагент;
			ИначеЕсли ЕстьКонтрагентВТабЧасти Тогда
				НоваяСтрока.НоменклатураЗатрат = СтрокаТЧ.Контрагент;
			КонецЕсли; 
			
			Если ЕстьКоличество Тогда
				НоваяСтрока.НоменклатураЗатратКоличество = Знак * СтрокаТЧ.Количество;
			КонецЕсли;
			
		ИначеЕсли ЕстьБрак И ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			
			// Если были услуги производственного характера по исправлению брака
			НоваяСтрока = ТаблицаДвиженийБрак.Добавить();
			НоваяСтрока.Подразделение           = Подр;
			НоваяСтрока.СтатьяЗатрат            = СтатьяЗатрат;
			НоваяСтрока.НоменклатурнаяГруппа    = СтрокаТЧ.НоменклатурнаяГруппа;
			НоваяСтрока.Сумма                   = СуммаУпр;
			НоваяСтрока.НДС						= НДСУпр;
			
		ИначеЕсли ЕстьСтроит И СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы Тогда
			
			НоваяСтрока = ТаблицаДвиженийСтроит.Добавить();
			НоваяСтрока.ОбъектСтроительства = СтрокаТЧ.ОбъектСтроительства;
			НоваяСтрока.Сумма				= СуммаУпр;
			
		Иначе

			НоваяСтрока = ТаблицаДвиженийЗатраты.Добавить();
			НоваяСтрока.Подразделение        = Подр;
			НоваяСтрока.СтатьяЗатрат         = СтатьяЗатрат;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.НоменклатурнаяГруппа;
			НоваяСтрока.Сумма                = СуммаУпр;
			НоваяСтрока.НДС 				 = НДСУпр;
			
			// заказ покупателя заполняем только для затрат на сбыт
			Если ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт Тогда
				НоваяСтрока.Заказ = Заказ;
			Иначе
				НоваяСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
			КонецЕсли; 
			
		КонецЕсли;

	КонецЦикла;
	
	ПериодДвижений = ДокОбъект.Дата;
	
	// Записать движения
	НаборДвиженийНЗП.мПериод                 = ПериодДвижений;
	НаборДвиженийНЗП.мТаблицаДвижений        = ТаблицаДвиженийНЗП;
	
	НаборДвиженийЗатраты.мПериод             = ПериодДвижений;
	НаборДвиженийЗатраты.мТаблицаДвижений    = ТаблицаДвиженийЗатраты;
	
	Если ЕстьБрак Тогда
		НаборДвиженийБрак.мПериод                = ПериодДвижений;
		НаборДвиженийБрак.мТаблицаДвижений       = ТаблицаДвиженийБрак;
	КонецЕсли;
	
	Если ЕстьСтроит Тогда
		НаборДвиженийСтроит.мПериод              = ПериодДвижений;
		НаборДвиженийСтроит.мТаблицаДвижений     = ТаблицаДвиженийСтроит;
	КонецЕсли;
	
	Если ВыполнитьПриход Тогда
		
		НаборДвиженийНЗП     .ВыполнитьПриход();
		НаборДвиженийНЗП     .Записать(Ложь);
		НаборДвиженийЗатраты .ВыполнитьПриход();
		НаборДвиженийЗатраты .Записать(Ложь);
		Если ЕстьБрак Тогда
			НаборДвиженийБрак.ВыполнитьПриход();
			НаборДвиженийБрак.Записать(Ложь);
		КонецЕсли;
		Если ЕстьСтроит Тогда
			НаборДвиженийСтроит.ВыполнитьПриход();
			НаборДвиженийСтроит.Записать(Ложь);
		КонецЕсли;
		
	Иначе
		
		НаборДвиженийНЗП     .ВыполнитьРасход();
		НаборДвиженийНЗП     .Записать(Ложь);
		НаборДвиженийЗатраты .ВыполнитьРасход();
		НаборДвиженийЗатраты .Записать(Ложь);
		Если ЕстьБрак Тогда
			НаборДвиженийБрак.ВыполнитьРасход();
			НаборДвиженийБрак.Записать(Ложь);
		КонецЕсли;
		Если ЕстьСтроит Тогда
			НаборДвиженийСтроит.ВыполнитьРасход();
			НаборДвиженийСтроит.Записать(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоПрочимЗатратамУпр()

// Функция формирует структуру таблицы значений для отражения производственных затрат в регистрах.
//
Функция СформироватьТаблицуЗатрат() Экспорт

	ТаблицаЗатрат = Новый ТаблицаЗначений;
	ТаблицаЗатрат.Колонки.Добавить("Номенклатура",				Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗатрат.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаЗатрат.Колонки.Добавить("СерияНоменклатуры",			Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));

	ТаблицаЗатрат.Колонки.Добавить("СтатьяЗатрат",				Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
	ТаблицаЗатрат.Колонки.Добавить("НоменклатурнаяГруппа",		Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	ТаблицаЗатрат.Колонки.Добавить("Подразделение",				Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаЗатрат.Колонки.Добавить("СпособРаспределенияЗатратНаВыпуск");
	ТаблицаЗатрат.Колонки.Добавить("Заказ");
	ТаблицаЗатрат.Колонки.Добавить("Проект");

	ТаблицаЗатрат.Колонки.Добавить("Продукция",					Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗатрат.Колонки.Добавить("ХарактеристикаПродукции", 	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаЗатрат.Колонки.Добавить("СерияПродукции",			Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));

	ТаблицаЗатрат.Колонки.Добавить("Количество",				ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 3));
	ТаблицаЗатрат.Колонки.Добавить("Сумма",						ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТаблицаЗатрат.Колонки.Добавить("СуммаРегл",					ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТаблицаЗатрат.Колонки.Добавить("СуммаНал",					ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТаблицаЗатрат.Колонки.Добавить("ПостояннаяРазница",			ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТаблицаЗатрат.Колонки.Добавить("ВременнаяРазница",			ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));

	Возврат ТаблицаЗатрат;

КонецФункции // СформироватьТаблицуЗатрат()
